// Критерії прийому
// Створено окремий репозиторій
// При здачі домашньої роботи є посилання на вихідні файли в репозиторії
// Кожне завдання виконано в окремому файлі з ім'ям task-номер_завдання.js. Використовуй <script type="module"> щоб закрити код завдання в окремій області видимості і уникнути конфліктів імен ідентифікаторів.
// Імена змінних зрозумілі, описові
// Код відформатований за допомогою Prettier
// 1:12
// Завдання 1
// Напиши скрипт, який, для об'єкта user, послідовно:
// додає поле mood зі значенням 'happy'
// замінює значення hobby на 'skydiving'
// замінює значення premium на false
// виводить вміст об'єкта user в форматі ключ:значення використовуючи Object.keys() і for...of
// const user = {
//   name: 'Mango',
//   age: 20,
//   hobby: 'html',
//   premium: true,
// };


const user = {
    name: 'Mango',
    age: 20,
    hobby: 'html',
    premium: true,
};

user.mood = 'happy'
user.hobby = 'skydiving'
user.premium = false

for (const key in user) {
    console.log(`${key}: ${user[key]}`);

}