// Завдання 1
//Оголоси дві змінні, які зберігають назву та ціну товару: name і price
//Присвойте змінним наступні характеристики товару (відразу при оголошенні)
//назва: Генератор захисного поля
//ціна: 1000
//Використовуючи стандартний рядок виведи в консоль інформацію про товар, вийде: 'Обрано «Генератор захисного поля», ціна за штуку 1000 кредитів'.
//Присвой товару нову ціну - 2000
//Використовуючи стандартний рядок виведи в консоль інформацію про товар, вийде: 'Обрано «Генератор захисного поля», ціна за штуку 2000 кредитів'.
//(edited)

let name = 'генератор захисного поля';
let price = 1000;
let price2 = 2000;

let msg1 = ( `Обрано ${name} , ціна за штуку ${price} кредитів`);

let msg2 = (`Обрано ${name} , ціна за штуку ${price2} кредитів`);

console.log(msg1);
console.log(msg2);

